MusaMahmood/nRF52_GSR_ADS1220/main.c
        // Re-enable AD5242 & set to ad5242_rdac_val
        ad5242_twi_init(m_twi);
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        // Re-enable TMP116
        tmp116_twi_init(m_twi1);
        tmp116_set_mode(m_twi1);
        // Re-enable ADS1220 and start cycle.
        ads_spi_init();
        ads1220_reset();              // Reset to ensure device is properly working
        ads1220_init_default_regs();  // Write default registers
        ads1220_start_sync();         // start converting in continuous mode
      }
    }
#endif
    if (m_calibration_flag) {
      m_calibration_flag = false;
      // Calibrate if out of range: Re-interpret 24-bit int as 32-bit int
      int32_t value = ((m_sg.sg_ch1_buffer[m_calibration_index] << 24) | (m_sg.sg_ch1_buffer[m_calibration_index + 1] << 16) | (m_sg.sg_ch1_buffer[m_calibration_index + 2] << 8)) >> 8;
      NRF_LOG_INFO("Current Value: %d \r\n", value);
      if (value < 409600 && !m_out_of_range_neg_flag) { // Out of range (V < 0.1)
        NRF_LOG_INFO("[LOW THRESHOLD] - Value out of range! : %d\r\n", value);
        m_out_of_range_neg_flag = true;
      }

      if (m_out_of_range_neg_flag) {
        if (ad5242_rdac_val != 255)
          ad5242_rdac_val++; // Increase resistance
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        NRF_LOG_INFO("Updated RDAC Value to %d\r\n", ad5242_rdac_val);
        if (value > 2457600) // if > 0.6V, stop
          m_out_of_range_neg_flag = false;
      }

      if (value > 6512639 && !m_out_of_range_pos_flag) { // Out of range (V > 1.59)
        NRF_LOG_INFO("[HIGH THRESHOLD] - Value out of range! : %d\r\n", value);
        m_out_of_range_pos_flag = true;
      }

      if (m_out_of_range_pos_flag) {
        if (ad5242_rdac_val != 0)
          ad5242_rdac_val--; // Decrease resistance
        ad5242_write_rdac1_value(m_twi, ad5242_rdac_val);
        NRF_LOG_INFO("Updated RDAC Value to %d\r\n", ad5242_rdac_val);
        if (value < 4096000) // if < 1.0 V, stop
          m_out_of_range_pos_flag = false;
      }
    }
  }
#endif
}

/**
 * @}
 */